# Part 1: Pandas - from Zero to Hero

## Pandas Series

### First Steps with Pandas Series

In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv("titanic.csv")

In [3]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

# 특정 행만 추출하기

In [140]:
fare = titanic.fare

In [143]:
fare_row = titanic[titanic.fare==7.25]

In [145]:
fare_row

     survived  pclass     sex   age  sibsp  parch  fare embarked deck
0           1       3    male  22.0      1      0  7.25        S  NaN
94          1       3    male  59.0      0      0  7.25        S  NaN
212         1       3    male  22.0      0      0  7.25        S  NaN
227         1       3    male  20.5      0      0  7.25        S  NaN
250         1       3    male   NaN      0      0  7.25        S  NaN
320         1       3    male  22.0      0      0  7.25        S  NaN
365         1       3    male  30.0      0      0  7.25        S  NaN
376         1       3  female  22.0      0      0  7.25        S  NaN
425         1       3    male   NaN      0      0  7.25        S  NaN
470         1       3    male   NaN      0      0  7.25        S  NaN
491         1       3    male  21.0      0      0  7.25        S  NaN
592         1       3    male  47.0      0      0  7.25        S  NaN
785         1       3    male  25.0      0      0  7.25        S  NaN

In [9]:
titanic["age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [10]:
type(titanic["age"])

pandas.core.series.Series

In [ ]:
titanic["age"].equals(titanic.age)

In [11]:
age = titanic["age"]

In [12]:
age.head(2)

0    22.0
1    38.0
Name: age, dtype: float64

In [13]:
age.tail()

886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, dtype: float64

In [14]:
age.dtype

dtype('float64')

In [15]:
age.shape

(891,)

In [16]:
len(age)

891

In [17]:
age.index

RangeIndex(start=0, stop=891, step=1)

In [18]:
age.info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: age
Non-Null Count  Dtype
--------------  -----
714 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

In [19]:
age.to_frame().info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     714 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

###  Analyzing Numerical Series

In [20]:
age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [21]:
age.describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: age, dtype: float64

In [22]:
age.count()

714

In [23]:
age.size

891

In [24]:
len(age)

891

In [28]:
age.index

RangeIndex(start=0, stop=891, step=1)

In [25]:
age.sum(skipna = False)

nan

In [31]:
age.sum() #얘는 기본적으로 아닌 값들은 제외한다. skipna가 그 설정임.

21205.17

In [29]:
sum(age) #NaN값들을 처리할 수 없기 때문에 NaN이 뜬다.(not a number)

nan

In [32]:
age.mean()

29.69911764705882

In [34]:
age.median() #50%의 값

28.0

In [36]:
age.std() #표준편차

14.526497332334044

In [ ]:
age.min()

In [ ]:
age.max()

In [38]:
age.unique() #중복값이 아닌 값들만 표시

array([22.  , 38.  , 26.  , 35.  ,   nan, 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  , 28.  ,
        8.  , 19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  ,
       49.  , 29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  ,
       16.  , 25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  ,
       71.  , 37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 ,
       51.  , 55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  ,
       45.5 , 20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  ,
       60.  , 10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  ,
       70.  , 24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

In [39]:
len(age.unique()) #고유값의 수만 출력해줌

89

In [44]:
age.nunique(dropna = False) #dropna는 결측값을 제외한다. True라면 제외한다는 뜻, Default는 True이기 때문에 88이 나오게된다.

89

In [46]:
age.value_counts() #빈도수가 가장 많은 값부터 출력해준다.

age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [48]:
age.value_counts(sort = True).

age
22.00    27
38.00    11
26.00    18
35.00    18
54.00     8
         ..
0.67      1
30.50     2
0.42      1
34.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [49]:
age.value_counts(sort = False) #이렇게 하면 그냥 나이 순서대로 출력한다

age
22.00    27
38.00    11
26.00    18
35.00    18
54.00     8
         ..
0.67      1
30.50     2
0.42      1
34.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [50]:
age.value_counts(dropna = True)

age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [51]:
age.value_counts(dropna = False) #Nan이 포함되는 설정

age
NaN      177
24.00     30
22.00     27
18.00     26
28.00     25
        ...
36.50      1
55.50      1
0.92       1
23.50      1
74.00      1
Name: count, Length: 89, dtype: int64

In [ ]:
age.value_counts(ascending = False) #내림차순

In [ ]:
age.value_counts(ascending = True)

In [52]:
age.value_counts(sort = True, dropna = True, ascending = False, normalize = False)

age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [53]:
age.value_counts(sort = True, dropna = True, ascending = False, normalize = True)

age
24.00    0.042017
22.00    0.037815
18.00    0.036415
19.00    0.035014
28.00    0.035014
           ...
36.50    0.001401
55.50    0.001401
0.92     0.001401
23.50    0.001401
74.00    0.001401
Name: proportion, Length: 88, dtype: float64

In [59]:
30/age.count() ######이 값은 결측값이 제외된 상태######이다. 결측값을 포함한 분포를 보려면 dropna를 true로 설정한뒤 봐야함

0.04201680672268908

In [56]:
age.value_counts(sort = True, dropna = False, ascending = False, normalize = True)

age
NaN      0.198653
24.00    0.033670
22.00    0.030303
18.00    0.029181
28.00    0.028058
           ...
36.50    0.001122
55.50    0.001122
0.92     0.001122
23.50    0.001122
74.00    0.001122
Name: proportion, Length: 89, dtype: float64

In [60]:
30/age.size

0.03367003367003367

In [62]:
age.value_counts(sort = True, dropna = True, ascending= False, normalize = False, bins = 5) 
#bins는 일정한 구간으로 잘라주는 것. 16으로 하면 총 5개의 구간이 16살씩 쪼개진다.

age
(16.336, 32.252]    346
(32.252, 48.168]    188
(0.339, 16.336]     100
(48.168, 64.084]     69
(64.084, 80.0]       11
Name: count, dtype: int64

In [64]:
age.value_counts(sort = True, dropna = True, ascending= False, normalize = True, bins = 10)
#normalize의 값으로 상대값, 절대값을 정할 수 있다.

age
(16.336, 24.294]    0.198653
(24.294, 32.252]    0.189675
(32.252, 40.21]     0.132435
(40.21, 48.168]     0.078563
(0.339, 8.378]      0.060606
(8.378, 16.336]     0.051627
(48.168, 56.126]    0.050505
(56.126, 64.084]    0.026936
(64.084, 72.042]    0.010101
(72.042, 80.0]      0.002245
Name: proportion, dtype: float64

### Analyzing non-numerical Series

In [ ]:
import pandas as pd

In [92]:
summer = pd.read_csv("summer.csv")

In [68]:
summer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31165 entries, 0 to 31164
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31165 non-null  int64
 1   City        31165 non-null  object
 2   Sport       31165 non-null  object
 3   Discipline  31165 non-null  object
 4   Athlete     31165 non-null  object
 5   Country     31161 non-null  object
 6   Gender      31165 non-null  object
 7   Event       31165 non-null  object
 8   Medal       31165 non-null  object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [94]:
summer

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver
...,...,...,...,...,...,...,...,...,...
31160,2012,London,Wrestling,Wrestling Freestyle,"JANIKOWSKI, Damian",POL,Men,Wg 84 KG,Bronze
31161,2012,London,Wrestling,Wrestling Freestyle,"REZAEI, Ghasem Gholamreza",IRI,Men,Wg 96 KG,Gold
31162,2012,London,Wrestling,Wrestling Freestyle,"TOTROV, Rustam",RUS,Men,Wg 96 KG,Silver
31163,2012,London,Wrestling,Wrestling Freestyle,"ALEKSANYAN, Artur",ARM,Men,Wg 96 KG,Bronze
31164,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze

In [105]:
athlete = summer.Athlete

In [70]:
athlete = summer["Athlete"]

In [72]:
athlete

0                    HAJOS, Alfred
1                 HERSCHMANN, Otto
2                DRIVAS, Dimitrios
3               MALOKINIS, Ioannis
4               CHASAPIS, Spiridon
                   ...
31160           JANIKOWSKI, Damian
31161    REZAEI, Ghasem Gholamreza
31162               TOTROV, Rustam
31163            ALEKSANYAN, Artur
31164               LIDBERG, Jimmy
Name: Athlete, Length: 31165, dtype: object

In [71]:
athlete.head()

0         HAJOS, Alfred
1      HERSCHMANN, Otto
2     DRIVAS, Dimitrios
3    MALOKINIS, Ioannis
4    CHASAPIS, Spiridon
Name: Athlete, dtype: object

In [73]:
athlete.tail(5)

31160           JANIKOWSKI, Damian
31161    REZAEI, Ghasem Gholamreza
31162               TOTROV, Rustam
31163            ALEKSANYAN, Artur
31164               LIDBERG, Jimmy
Name: Athlete, dtype: object

In [74]:
type(athlete)

pandas.core.series.Series

In [75]:
athlete.dtype

dtype('O')

In [76]:
athlete.shape

(31165,)

In [77]:
athlete.describe()

count               31165
unique              22762
top       PHELPS, Michael
freq                   22
Name: Athlete, dtype: object

In [79]:
athlete.size

31165

In [80]:
athlete.count()

31165

In [81]:
athlete.min()

'AABYE, Edgar'

In [82]:
athlete.unique()

array(['HAJOS, Alfred', 'HERSCHMANN, Otto', 'DRIVAS, Dimitrios', ...,
       'TOTROV, Rustam', 'ALEKSANYAN, Artur', 'LIDBERG, Jimmy'],
      dtype=object)

In [83]:
len(athlete.unique())

22762

In [84]:
athlete.nunique(dropna= False) # NAN값 포함

22762

In [112]:
summer.sort_values(by="Medal")#궁금해서 해봄

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
31164,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze
9352,1956,Melbourne / Stockholm,Fencing,Fencing,"FÜLÖP, Mihaly",HUN,Men,Foil Team,Bronze
9353,1956,Melbourne / Stockholm,Fencing,Fencing,"GYURICZA, Jozsef",HUN,Men,Foil Team,Bronze
9354,1956,Melbourne / Stockholm,Fencing,Fencing,"MAROSI, Jozsef",HUN,Men,Foil Team,Bronze
9355,1956,Melbourne / Stockholm,Fencing,Fencing,"SAKOVICS, Jozsef",HUN,Men,Foil Team,Bronze
9356,1956,Melbourne / Stockholm,Fencing,Fencing,"SOMODI, Lajos",HUN,Men,Foil Team,Bronze
9357,1956,Melbourne / Stockholm,Fencing,Fencing,"TILLI, Endre",HUN,Men,Foil Team,Bronze
21530,1996,Atlanta,Aquatics,Water polo,"CALCATERRA, Roberto",ITA,Men,Water Polo,Bronze
21529,1996,Atlanta,Aquatics,Water polo,"CALCATERRA, Alessandro",ITA,Men,Water Polo,Bronze
21528,1996,Atlanta,Aquatics,Water polo,"BOVO, Alessandro",ITA,Men,Water Polo,Bronze
21531,1996,Atlanta,Aquatics,Water polo,"GERINI, Marco",ITA,Men,Water Polo,Bronze
21527,1996,Atlanta,Aquatics,Water polo,"BENCIVENGA, Fabio",ITA,Men,Water Polo,Bronze
21525,1996,Atlanta,Aquatics,Water polo,"ANGELINI, Alberto",ITA,Men,Water Polo,Bronze
9370,1956,Melbourne / Stockholm,Fencing,Fencing,"KUZNETSOV, Lev",URS,Men,Sabre Individual,Bronze
9373,1956,Melbourne / Stockholm,Fencing,Fencing,"BOGDANOV, Leonid",URS,Men,Sabre Team,Bronze
9374,1956,Melbourne / Stockholm,Fencing,Fencing,"CHEREPOVSKY, Yevgeni",URS,Men,Sabre Team,Bronze
9375,1956,Melbourne / Stockholm,Fencing,Fencing,"KUZNETSOV, Lev",URS,Men,Sabre Team,Bronze
9376,1956,Melbourne / Stockholm,Fencing,Fencing,"RYLSKY, Yakov",URS,Men,Sabre Team,Bronze
9377,1956,Melbourne / Stockholm,Fencing,Fencing,"TYSHLER, David",URS,Men,Sabre Team,Bronze
21504,1996,Atlanta,Aquatics,Synchronized S.,"TANAKA, Junko",JPN,Women,Team,Bronze
21503,1996,Atlanta,Aquatics,Synchronized S.,"TAKEDA, Miho",JPN,Women,Team,Bronze
21526,1996,Atlanta,Aquatics,Water polo,"ATTOLICO, Francesco",ITA,Men,Water Polo,Bronze
21502,1996,Atlanta,Aquatics,Synchronized S.,"TAKAHASHI, Kaori",JPN,Women,Team,Bronze
21532,1996,Atlanta,Aquatics,Water polo,"GHIBELLINI, Alberto",ITA,Men,Water Polo,Bronze
21533,1996,Atlanta,Aquatics,Water polo,"GIUSTOLISI, Luca",ITA,Men,Water Polo,Bronze
...,...,...,...,...,...,...,...,...,...
9073,1956,Melbourne / Stockholm,Athletics,Athletics,"GREGORY, Leonard Stuart",AUS,Men,4X400M Relay,Silver
9074,1956,Melbourne / Stockholm,Athletics,Athletics,"LEAN, David Francis",AUS,Men,4X400M Relay,Silver
9110,1956,Melbourne / Stockholm,Athletics,Athletics,"AHRENS, Marlene",CHI,Women,Javelin Throw,Silver
9107,1956,Melbourne / Stockholm,Athletics,Athletics,"SIDLO, Janusz",POL,Men,Javelin Throw,Silver
9104,1956,Melbourne / Stockholm,Athletics,Athletics,"PISSAREVA, Mariya",URS,Women,High Jump,Silver
21774,1996,Atlanta,Badminton,Badminton,"CHEAH, Soon Kit",MAS,Men,Doubles,Silver
21775,1996,Atlanta,Badminton,Badminton,"YAP, Kim Hock",MAS,Men,Doubles,Silver
21776,1996,Atlanta,Badminton,Badminton,"PARK, Joo-Bong",KOR,Men,Doubles,Silver
9103,1956,Melbourne / Stockholm,Athletics,Athletics,"HOPKINS, Thelma Elizabeth",GBR,Women,High Jump,Silver
9101,1956,Melbourne / Stockholm,Athletics,Athletics,"PORTER, Charles Michael",AUS,Men,High Jump,Silver
9098,1956,Melbourne / Stockholm,Athletics,Athletics,"KRIVONOSOV, Mikhail",URS,Men,Hammer Throw,Silver
21783,1996,Atlanta,Badminton,Badminton,"GIL, Young-Ah",KOR,Women,Doubles,Silver
21784,1996,Atlanta,Badminton,Badminton,"JANG, Hye Ock",KOR,Women,Doubles,Silver
21785,1996,Atlanta,Badminton,Badminton,"RA, Kyung-Min",KOR,Women,Doubles,Silver
9095,1956,Melbourne / Stockholm,Athletics,Athletics,"BEGLYAKOVA, Irina",URS,Women,Discus Throw,Silver
21788,1996,Atlanta,Badminton,Badminton,"DONG, Jiong",CHN,Men,Singles,Silver
9092,1956,Melbourne / Stockholm,Athletics,Athletics,"GORDIEN, Fortune Edward",USA,Men,Discus Throw,Silver
21791,1996,Atlanta,Badminton,Badminton,"AUDINA, Mia",INA,Women,Singles,Silver
9089,1956,Melbourne / Stockholm,Athletics,Athletics,"JOHNSON, Rafer Lewis",USA,Men,Decathlon,Silver
9086,1956,Melbourne / Stockholm,Athletics,Athletics,"KÖHLER-BIRKEMEYER, Gisela",EUA,Women,80M Hurdles,Silver
9083,1956,Melbourne / Stockholm,Athletics,Athletics,"JOHNSON, Derek James Neville",GBR,Men,800M,Silver
9080,1956,Melbourne / Stockholm,Athletics,Athletics,"MASKINSKOV, Yevgeni",URS,Men,50KM Walk,Silver
9077,1956,Melbourne / Stockholm,Athletics,Athletics,"PIRIE, Douglas A.Gordon",GBR,Men,5000M,Silver
9113,1956,Melbourne / Stockholm,Athletics,Athletics,"BENNETT, John Dale",USA,Men,Long Jump,Silver
15582,1980,Moscow,Basketball,Basketball,"DERMENDJIEVA, Vania",BUL,Women,Basketball,Silver

In [102]:
pd.options.display.min_rows = 50

In [113]:
athlete.value_counts(sort = True, ascending=True)

Athlete
UDVARDI, Istvan                1
LIM, Jin-Suk                   1
LEE, Sang-Hyo                  1
KOH, Suk-Chang                 1
KIM, Jae-Hwan                  1
KANG, Jae-Won                  1
CHOI, Suk-Jae                  1
VASILIEV, Mikhail              1
SVIRIDENKO, Georgi             1
SHEVTSOV, Yuri                 1
SHAROVAROV, Konstantin         1
RYMANOV, Aleksandr             1
NESTEROV, Yuri                 1
GOPIN, Valeri                  1
CHUMENTSEV, Andrei             1
CHUMAK, Igor                   1
OH, Young-Ki                   1
ATAVIN, Vyacheslav             1
PARK, Do-Hun                   1
ROH, Hyun-Suk                  1
KIM, Hyun-Mee                  1
HAN, Hyun-Sook                 1
TOVSTOGAN, Yevgeniya           1
SEMENOVA, Olga                 1
RUSNACHENKO, Natalya           1
                              ..
VAN ALMSICK, Franziska        10
LEWIS, Carl                   10
GEREVICH, Aladar              10
ASTAKHOVA, Polina             10
KELETI, Agnes                 10
HALL, Gary Jr.                10
CHUKARIN, Viktor Ivanovich    11
BIONDI, Matthew               11
CASLAVSKA, Vera               11
LOCHTE, Ryan                  11
OSBURN, Carl Townsend         11
SPITZ, Mark                   11
THOMPSON, Jenny               12
NEMOV, Alexei                 12
KATO, Sawao                   12
FISCHER, Birgit               12
COUGHLIN, Natalie             12
NURMI, Paavo                  12
TORRES, Dara                  12
MANGIAROTTI, Edoardo          13
ONO, Takashi                  13
SHAKHLIN, Boris               13
ANDRIANOV, Nikolay            15
LATYNINA, Larisa              18
PHELPS, Michael               22
Name: count, Length: 22762, dtype: int64

In [114]:
athlete.value_counts(sort = True, ascending=False, normalize = True).head()

Athlete
PHELPS, Michael         0.000706
LATYNINA, Larisa        0.000578
ANDRIANOV, Nikolay      0.000481
ONO, Takashi            0.000417
MANGIAROTTI, Edoardo    0.000417
Name: proportion, dtype: float64

### Creating Pandas Series (Part 1)

In [115]:
import pandas as pd

#### from DataFrame

In [116]:
summer = pd.read_csv("summer.csv")

In [ ]:
summer.head()

In [117]:
summer["Athlete"]

0                            HAJOS, Alfred
1                         HERSCHMANN, Otto
2                        DRIVAS, Dimitrios
3                       MALOKINIS, Ioannis
4                       CHASAPIS, Spiridon
5                    CHOROPHAS, Efstathios
6                            HAJOS, Alfred
7                         ANDREOU, Joannis
8                    CHOROPHAS, Efstathios
9                            NEUMANN, Paul
10                       PEPANOS, Antonios
11                           LANE, Francis
12                        SZOKOLYI, Alajos
13                           BURKE, Thomas
14                          HOFMANN, Fritz
15                          CURTIS, Thomas
16                      GOULDING, Grantley
17                       LERMUSIAUX, Albin
18                            FLACK, Edwin
19                           BLAKE, Arthur
20                         GMELIN, Charles
21                           BURKE, Thomas
22                        JAMISON, Herbert
23                      GOLEMIS, Dimitrios
24                            FLACK, Edwin
                       ...
31140                        KAYAALP, Riza
31141    SORYAN REIHANPOUR, Hamid Mohammad
31142                    BAYRAMOV, Rovshan
31143                         MODOS, Peter
31144                    SEMENOV, Mingiyan
31145                   NOROOZI, Omid Haji
31146                       LASHKHI, Revaz
31147                  KURAMAGOMEDOV, Zaur
31148                   MATSUMOTO, Ryutaro
31149                        KIM, Hyeonwoo
31150                       LORINCZ, Tamas
31151                       GUENOT, Steeve
31152                  TSKHADAIA, Manuchar
31153                        VLASOV, Roman
31154                   JULFALAKYAN, Arsen
31155                        AHMADOV, Emin
31156                 KAZAKEVIC, Aleksandr
31157                        KHUGAEV, Alan
31158         EBRAHIM, Karam Mohamed Gaber
31159                      GAJIYEV, Danyal
31160                   JANIKOWSKI, Damian
31161            REZAEI, Ghasem Gholamreza
31162                       TOTROV, Rustam
31163                    ALEKSANYAN, Artur
31164                       LIDBERG, Jimmy
Name: Athlete, Length: 31165, dtype: object

In [118]:
summer.Athlete

0                            HAJOS, Alfred
1                         HERSCHMANN, Otto
2                        DRIVAS, Dimitrios
3                       MALOKINIS, Ioannis
4                       CHASAPIS, Spiridon
5                    CHOROPHAS, Efstathios
6                            HAJOS, Alfred
7                         ANDREOU, Joannis
8                    CHOROPHAS, Efstathios
9                            NEUMANN, Paul
10                       PEPANOS, Antonios
11                           LANE, Francis
12                        SZOKOLYI, Alajos
13                           BURKE, Thomas
14                          HOFMANN, Fritz
15                          CURTIS, Thomas
16                      GOULDING, Grantley
17                       LERMUSIAUX, Albin
18                            FLACK, Edwin
19                           BLAKE, Arthur
20                         GMELIN, Charles
21                           BURKE, Thomas
22                        JAMISON, Herbert
23                      GOLEMIS, Dimitrios
24                            FLACK, Edwin
                       ...
31140                        KAYAALP, Riza
31141    SORYAN REIHANPOUR, Hamid Mohammad
31142                    BAYRAMOV, Rovshan
31143                         MODOS, Peter
31144                    SEMENOV, Mingiyan
31145                   NOROOZI, Omid Haji
31146                       LASHKHI, Revaz
31147                  KURAMAGOMEDOV, Zaur
31148                   MATSUMOTO, Ryutaro
31149                        KIM, Hyeonwoo
31150                       LORINCZ, Tamas
31151                       GUENOT, Steeve
31152                  TSKHADAIA, Manuchar
31153                        VLASOV, Roman
31154                   JULFALAKYAN, Arsen
31155                        AHMADOV, Emin
31156                 KAZAKEVIC, Aleksandr
31157                        KHUGAEV, Alan
31158         EBRAHIM, Karam Mohamed Gaber
31159                      GAJIYEV, Danyal
31160                   JANIKOWSKI, Damian
31161            REZAEI, Ghasem Gholamreza
31162                       TOTROV, Rustam
31163                    ALEKSANYAN, Artur
31164                       LIDBERG, Jimmy
Name: Athlete, Length: 31165, dtype: object

In [119]:
summer.iloc[0]

Year                    1896
City                  Athens
Sport               Aquatics
Discipline          Swimming
Athlete        HAJOS, Alfred
Country                  HUN
Gender                   Men
Event         100M Freestyle
Medal                   Gold
Name: 0, dtype: object

#### Importing from CSV

In [122]:
pd.read_csv("summer.csv", usecols = ["Athlete"], squeeze = True)

TypeError: read_csv() got an unexpected keyword argument 'squeeze'

#### Creating from scratch with pd.Series()

In [123]:
pd.Series([10,25,6,36,2]) #Series 데이터타입을 만들기

0    10
1    25
2     6
3    36
4     2
dtype: int64

In [ ]:
#pd.Series([10,25,6,36,2], index=["Mon","Tue","Wed","Thu", "Fri", "Sat"])

In [126]:
pd.Series([10,25,6,36,2], index=["Mon","Tue","Wed","Thu", "Fri"], name = "Sales")

Mon    10
Tue    25
Wed     6
Thu    36
Fri     2
Name: Sales, dtype: int64

In [133]:
pd.Series(Sales)

NameError: name 'Sales' is not defined

### Creating Pandas Series (Part 2)

#### from Numpy Array

In [131]:
import pandas as pd
import numpy as np

In [132]:
sales = np.array([10,25,6,36,2])
sales

array([10, 25,  6, 36,  2])

In [135]:
pd.Series(sales)

0    10
1    25
2     6
3    36
4     2
dtype: int32

#### from List

In [ ]:
sales = [10,25,6,36,2]

In [134]:
pd.Series(sales)

0    10
1    25
2     6
3    36
4     2
dtype: int32

#### from Dictionary

In [136]:
dic = {"Mon":10, "Tue":25, "Wed":6, "Thu": 36, "Fri": 2}
dic

{'Mon': 10, 'Tue': 25, 'Wed': 6, 'Thu': 36, 'Fri': 2}

In [137]:
sales = pd.Series(dic)

In [138]:
sales

Mon    10
Tue    25
Wed     6
Thu    36
Fri     2
dtype: int64

In [139]:
pd.Series(dic, index = ["Fri", "Sat", "Sun", "Mon", "Tue", "Wed"])

Fri     2.0
Sat     NaN
Sun     NaN
Mon    10.0
Tue    25.0
Wed     6.0
dtype: float64

In [140]:
pd.Series(dic, index = [1,2,3,4,5])

1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
dtype: float64

### Indexing and Slicing

In [4]:
import pandas as pd

In [46]:
titanic = pd.read_csv("titanic.csv")

In [128]:
titanic

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
0           0       3    male  22.0      1      0   7.2500        S  NaN
1           1       1  female  38.0      1      0  71.2833        C    C
2           1       3  female  26.0      0      0   7.9250        S  NaN
3           1       1  female  35.0      1      0  53.1000        S    C
4           0       3    male  35.0      0      0   8.0500        S  NaN
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
886         0       2    male  27.0      0      0  13.0000        S  NaN
887         1       1  female  19.0      0      0  30.0000        S    B
888         0       3  female   NaN      1      2  23.4500        S  NaN
889         1       1    male  26.0      0      0  30.0000        C    C
890         0       3    male  32.0      0      0   7.7500        Q  NaN

[891 rows x 9 columns]

In [133]:
live=titanic.survived==1

In [134]:
live

0      True
1      True
2      True
3      True
4      True
       ...
886    True
887    True
888    True
889    True
890    True
Name: survived, Length: 891, dtype: bool

In [36]:
resuced = pd.read_csv("titanic.csv", index_col = "fare")

In [42]:
rescued.loc[7.25]

      survived  pclass     sex   age  sibsp  parch embarked deck
fare
7.25         0       3    male  22.0      1      0        S  NaN
7.25         0       3    male  59.0      0      0        S  NaN
7.25         0       3    male  22.0      0      0        S  NaN
7.25         0       3    male  20.5      0      0        S  NaN
7.25         0       3    male   NaN      0      0        S  NaN
7.25         0       3    male  22.0      0      0        S  NaN
7.25         0       3    male  30.0      0      0        S  NaN
7.25         1       3  female  22.0      0      0        S  NaN
7.25         0       3    male   NaN      0      0        S  NaN
7.25         0       3    male   NaN      0      0        S  NaN
7.25         0       3    male  21.0      0      0        S  NaN
7.25         0       3    male  47.0      0      0        S  NaN
7.25         0       3    male  25.0      0      0        S  NaN

In [58]:
titanic.loc[3]

survived         1
pclass           1
sex         female
age           35.0
sibsp            1
parch            0
fare          53.1
embarked         S
deck             C
Name: 3, dtype: object

In [64]:
titanic.iloc[-1]

survived       0
pclass         3
sex         male
age         32.0
sibsp          0
parch          0
fare        7.75
embarked       Q
deck         NaN
Name: 890, dtype: object

In [3]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [4]:
titanic.tail()

     survived  pclass     sex   age  sibsp  parch   fare embarked deck
886         0       2    male  27.0      0      0  13.00        S  NaN
887         1       1  female  19.0      0      0  30.00        S    B
888         0       3  female   NaN      1      2  23.45        S  NaN
889         1       1    male  26.0      0      0  30.00        C    C
890         0       3    male  32.0      0      0   7.75        Q  NaN

In [11]:
titanic["survived"]

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [15]:
titanic.survived

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [5]:
age = titanic.age

In [6]:
age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [7]:
age.tail()

886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, dtype: float64

In [8]:
age.index

RangeIndex(start=0, stop=891, step=1)

In [ ]:
age[0]

In [ ]:
age[2]

In [20]:
age.iloc[-1]

32.0

In [ ]:
age[890]

In [ ]:
age[[3,4]]

In [ ]:
age.loc[:3]

In [5]:
summer = pd.read_csv("summer.csv", index_col = "Athlete")

In [123]:
summer

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver
...,...,...,...,...,...,...,...,...,...
31160,2012,London,Wrestling,Wrestling Freestyle,"JANIKOWSKI, Damian",POL,Men,Wg 84 KG,Bronze
31161,2012,London,Wrestling,Wrestling Freestyle,"REZAEI, Ghasem Gholamreza",IRI,Men,Wg 96 KG,Gold
31162,2012,London,Wrestling,Wrestling Freestyle,"TOTROV, Rustam",RUS,Men,Wg 96 KG,Silver
31163,2012,London,Wrestling,Wrestling Freestyle,"ALEKSANYAN, Artur",ARM,Men,Wg 96 KG,Bronze
31164,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze

In [2]:
event = summer.Event

NameError: name 'summer' is not defined

In [86]:
event

Athlete
HAJOS, Alfred                            100M Freestyle
HERSCHMANN, Otto                         100M Freestyle
DRIVAS, Dimitrios            100M Freestyle For Sailors
MALOKINIS, Ioannis           100M Freestyle For Sailors
CHASAPIS, Spiridon           100M Freestyle For Sailors
                                        ...
JANIKOWSKI, Damian                             Wg 84 KG
REZAEI, Ghasem Gholamreza                      Wg 96 KG
TOTROV, Rustam                                 Wg 96 KG
ALEKSANYAN, Artur                              Wg 96 KG
LIDBERG, Jimmy                                 Wg 96 KG
Name: Event, Length: 31165, dtype: object

In [34]:
event.head()

Athlete
HAJOS, Alfred                     100M Freestyle
HERSCHMANN, Otto                  100M Freestyle
DRIVAS, Dimitrios     100M Freestyle For Sailors
MALOKINIS, Ioannis    100M Freestyle For Sailors
CHASAPIS, Spiridon    100M Freestyle For Sailors
Name: Event, dtype: object

In [35]:
event.tail()

Athlete
JANIKOWSKI, Damian           Wg 84 KG
REZAEI, Ghasem Gholamreza    Wg 96 KG
TOTROV, Rustam               Wg 96 KG
ALEKSANYAN, Artur            Wg 96 KG
LIDBERG, Jimmy               Wg 96 KG
Name: Event, dtype: object

In [87]:
event.index

Index(['HAJOS, Alfred', 'HERSCHMANN, Otto', 'DRIVAS, Dimitrios',
       'MALOKINIS, Ioannis', 'CHASAPIS, Spiridon', 'CHOROPHAS, Efstathios',
       'HAJOS, Alfred', 'ANDREOU, Joannis', 'CHOROPHAS, Efstathios',
       'NEUMANN, Paul',
       ...
       'AHMADOV, Emin', 'KAZAKEVIC, Aleksandr', 'KHUGAEV, Alan',
       'EBRAHIM, Karam Mohamed Gaber', 'GAJIYEV, Danyal', 'JANIKOWSKI, Damian',
       'REZAEI, Ghasem Gholamreza', 'TOTROV, Rustam', 'ALEKSANYAN, Artur',
       'LIDBERG, Jimmy'],
      dtype='object', name='Athlete', length=31165)

In [ ]:
event[0]

In [ ]:
event[1]

In [33]:
event.iloc[-1]

'Wg 96 KG'

In [24]:
event.iloc[:3]

Athlete
HAJOS, Alfred                    100M Freestyle
HERSCHMANN, Otto                 100M Freestyle
DRIVAS, Dimitrios    100M Freestyle For Sailors
Name: Event, dtype: object

In [68]:
event["DRIVAS, Dimitrios"]

'100M Freestyle For Sailors'

In [69]:
event[:"DRIVAS, Dimitrios"]

Athlete
HAJOS, Alfred                    100M Freestyle
HERSCHMANN, Otto                 100M Freestyle
DRIVAS, Dimitrios    100M Freestyle For Sailors
Name: Event, dtype: object

In [1]:
event.loc["PHELPS, Michael"]

NameError: name 'event' is not defined

In [82]:
event.loc["PHELPS, Michael"].equals(event["PHELPS, Michael"])

True

In [ ]:
#event[:"PHELPS, Michael"]

In [83]:
event.loc[["PHELPS, Michael", "LEWIS, Carl"]]

Athlete
PHELPS, Michael            100M Butterfly
PHELPS, Michael            200M Butterfly
PHELPS, Michael            200M Freestyle
PHELPS, Michael    200M Individual Medley
PHELPS, Michael    400M Individual Medley
PHELPS, Michael    4X100M Freestyle Relay
PHELPS, Michael       4X100M Medley Relay
PHELPS, Michael    4X200M Freestyle Relay
PHELPS, Michael            100M Butterfly
PHELPS, Michael            200M Butterfly
PHELPS, Michael            200M Freestyle
PHELPS, Michael    200M Individual Medley
PHELPS, Michael    400M Individual Medley
PHELPS, Michael    4X100M Freestyle Relay
PHELPS, Michael       4X100M Medley Relay
PHELPS, Michael    4X200M Freestyle Relay
PHELPS, Michael            100M Butterfly
PHELPS, Michael            200M Butterfly
PHELPS, Michael               200M Medley
PHELPS, Michael          4X100M Freestyle
PHELPS, Michael             4X100M Medley
PHELPS, Michael          4X200M Freestyle
LEWIS, Carl                          100M
LEWIS, Carl                          200M
LEWIS, Carl                  4X100M Relay
LEWIS, Carl                     Long Jump
LEWIS, Carl                          100M
LEWIS, Carl                          200M
LEWIS, Carl                     Long Jump
LEWIS, Carl                  4X100M Relay
LEWIS, Carl                     Long Jump
LEWIS, Carl                     Long Jump
Name: Event, dtype: object

In [ ]:
#event[["PHELPS, Michael", "DUCK, Donald"]]

### Sorting and introduction to the  inplace-parameter

In [146]:
import pandas as pd

In [147]:
dic = {1:10, 3:25, 2:6, 4:36, 5:2, 6:0, 7:None}
dic

{1: 10, 3: 25, 2: 6, 4: 36, 5: 2, 6: 0, 7: None}

In [148]:
sales = pd.Series(dic)
sales

1    10.0
3    25.0
2     6.0
4    36.0
5     2.0
6     0.0
7     NaN
dtype: float64

In [ ]:
sales.sort_index()

In [ ]:
sales.sort_index(ascending = True, inplace= True)

In [ ]:
sales

In [ ]:
sales.sort_values(inplace=False) #inplace는 해당 배열에 저장하는 것(원본 배열이 변경되는 것)

In [ ]:
sales.sort_values(ascending=False, na_position="last", inplace= True)

In [ ]:
sales

In [ ]:
dic = {"Mon":10, "Tue":25, "Wed":6, "Thu": 36, "Fri": 2}
dic

In [ ]:
sales = pd.Series(dic)

In [ ]:
sales

In [ ]:
sales.sort_index(ascending=False)

### nlargest() and nsmallest()

In [ ]:
import pandas as pd

In [149]:
titanic = pd.read_csv("titanic.csv")

In [150]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [151]:
age = titanic.age

In [152]:
age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [153]:
age.sort_values(ascending=False).head(3)

630    80.0
851    74.0
493    71.0
Name: age, dtype: float64

In [169]:
titanic.iloc[630]

survived       1
pclass         1
sex         male
age         80.0
sibsp          0
parch          0
fare        30.0
embarked       S
deck           A
Name: 630, dtype: object

In [171]:
age.sort_values(ascending=True).iloc[:3]

803    0.42
755    0.67
644    0.75
Name: age, dtype: float64

In [170]:
age.nlargest(n = 3).index[0]

630

In [172]:
age.nsmallest(n = 3).index[0]

803

In [173]:
age.nsmallest(n = 3)

803    0.42
755    0.67
469    0.75
Name: age, dtype: float64

### idxmin() and idxmax()

In [174]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [175]:
titanic.age.idxmax() #가장 큰 값 반환

630

In [176]:
titanic.age.idxmin() #가장 작은 값 반환

803

In [ ]:
titanic.loc[630]

In [ ]:
titanic.loc[titanic.age.idxmin()]

In [ ]:
dic = {"Mon":10,"Tue":25, "Wed":6, "Thu":36, "Fri":2, "Sat":0, "Sun":None}
dic

In [ ]:
sales = pd.Series(dic)
sales

In [ ]:
sales.sort_values(ascending=True).index[0]

In [ ]:
sales.idxmin()

In [ ]:
sales.sort_values(ascending=False).index[0]

In [ ]:
sales.idxmax()

### Manipulating Series

In [ ]:
import pandas as pd

In [182]:
sales = pd.Series([10,25,6,36,2,0,None,5], index = ["Mon", "Tue", "Wed", "Thu", "Fri", "Sat", "Sun", "Mon"])
sales

Mon    10.0
Tue    25.0
Wed     6.0
Thu    36.0
Fri     2.0
Sat     0.0
Sun     NaN
Mon     5.0
dtype: float64

In [178]:
sales["Sun"] = 0

In [183]:
sales

Mon    10.0
Tue    25.0
Wed     6.0
Thu    36.0
Fri     2.0
Sat     0.0
Sun     NaN
Mon     5.0
dtype: float64

In [184]:
sales.iloc[3] = 30

In [185]:
sales

Mon    10.0
Tue    25.0
Wed     6.0
Thu    30.0
Fri     2.0
Sat     0.0
Sun     NaN
Mon     5.0
dtype: float64

In [186]:
(sales/1.1).round(2)

Mon     9.09
Tue    22.73
Wed     5.45
Thu    27.27
Fri     1.82
Sat     0.00
Sun      NaN
Mon     4.55
dtype: float64

In [187]:
sales_EUR = (sales/1.1).round(2)
sales_EUR

Mon     9.09
Tue    22.73
Wed     5.45
Thu    27.27
Fri     1.82
Sat     0.00
Sun      NaN
Mon     4.55
dtype: float64

In [188]:
sales = (sales/1.1).round(2)

In [189]:
sales

Mon     9.09
Tue    22.73
Wed     5.45
Thu    27.27
Fri     1.82
Sat     0.00
Sun      NaN
Mon     4.55
dtype: float64

In [ ]:
sales["Mon"] = 0

In [ ]:
sales

In [ ]:
titanic = pd.read_csv("titanic.csv")

In [ ]:
titanic.head()

In [ ]:
age = titanic["age"]

In [ ]:
age.head()

In [ ]:
age.tail()

In [190]:
age.iloc[1] = 30

C:\Users\halim\AppData\Local\Temp\ipykernel_30920\4019016307.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  age.iloc[1] = 30

In [ ]:
age.head()

In [ ]:
titanic.head()